MichaelLynnCSU/embedded-iot-hub/nrf52840/temp-sensor/src/legacy/trinity_log_zephyr_nrf.c
/******************************************************************************
 * \file trinity_log_zephyr_nrf.c
 * \author MichaelLynnCSU (https://github.com/MichaelLynnCSU)
 * \date 01-01-2025
 *
 * \brief Trinity crash logger -- nRF52840 Zephyr (reed-sensor, smart-lock,
 *        smart-light).
 *
 * \details Platform: nRF52840, Zephyr RTOS, Cortex-M4.
 *          Storage:  Flash partition (log_partition in DTS overlay).
 *          Console:  RTT (bench) / UART (field) / USB CDC (USB).
 *          Fault:    k_sys_fatal_error_handler + CFSR/HFSR/MMFAR/BFAR.
 *          Canary:   .noinit ELF section + SYS_INIT(PRE_KERNEL_1).
 *          WDT:      Bootloader WDT ch0 feed only -- no install/setup.
 *
 *          Build modes (set via Kconfig / boards/bench.conf):
 *            TRINITY_MODE_BENCH -- RTT + SWD halt (J-Link)
 *            TRINITY_MODE_USB   -- CDC ACM 500ms flush + NVIC_SystemReset()
 *            TRINITY_MODE_FIELD -- UART + NVIC_SystemReset() (default)
 *
 *          prj.conf requirements:
 *            CONFIG_WATCHDOG=y
 *            CONFIG_THREAD_ANALYZER=y
 *            CONFIG_THREAD_ANALYZER_USE_PRINTK=n
 *            CONFIG_SYS_HEAP_RUNTIME_STATS=y
 *            CONFIG_THREAD_RUNTIME_STATS=y
 *            CONFIG_INIT_STACKS=y
 *            CONFIG_SYSTEM_WORKQUEUE_STACK_SIZE=3072
 *            CONFIG_MAIN_STACK_SIZE=2048
 *            CONFIG_HEAP_MEM_POOL_SIZE=4096
 *            CONFIG_SOC_FLASH_NRF_RADIO_SYNC_TICKER=y
 *            CONFIG_SOC_FLASH_NRF_PARTIAL_ERASE=y
 *
 * \note    WDT fix (2026-03-21):
 *          nRF52840 WDT cannot be stopped after first boot.
 *          wdt_install_timeout() returns -ENOTSUP on subsequent resets.
 *          Original fix treated -EALREADY/-EBUSY/-ENOTSUP as "already
 *          running, fall back to ch0". See WDT field fix note below for
 *          the final resolution.
 *
 * \note    WDT bench fix (2026-03-22):
 *          wdt_setup(WDT_OPT_PAUSE_HALTED_BY_DBG) resets the chip under
 *          J-Link before RTT can output anything on a fresh board.
 *          Bench mode grabs wdt0, assumes channel 0 (bootloader), and feeds
 *          immediately without calling wdt_install_timeout()/wdt_setup().
 *
 * \note    Pre-init canary (2026-03-23):
 *          g_pre_init_canary written at PRE_KERNEL_1,0. Canary snapshot
 *          saves the previous session value before overwriting, so
 *          dump_previous() can classify PRE vs POST init crash correctly.
 *
 * \note    Init stage cookie (2026-03-24):
 *          g_init_stage in .noinit. Written by main() before each risky
 *          call. 0x0000 = crashed before main() wrote its first cookie.
 *
 * \note    Flash concurrency fix (2026-03-24):
 *          g_flash_mutex serializes all NVMC writes. nRF52840 NVMC is
 *          single-writer. Callers outside Trinity must use trinity_flash_lock/
 *          unlock() around settings_save_one() or equivalent.
 *
 * \note    Static buffer fix (2026-03-24):
 *          trinity_thread_cb() previously used static char msg[]. Concurrent
 *          calls corrupted return addresses.
 *          Confirmed crash: PC=0x5954494E ("NITY"), SP=0x003BA538.
 *
 * \note    Panic bypass + write_internal refactor (2026-03-25):
 *          write_internal() -- raw flash write, no locks, no OS calls.
 *          write_entry()    -- mutex wrapper for normal thread context.
 *          write_panic()    -- lock-free path for fault handler only.
 *
 * \note    k_cycle_get_32() in fault handler (2026-03-25):
 *          k_uptime_get_32() depends on SysTick ISR which may be dead at
 *          fault time. k_cycle_get_32() reads DWT hardware counter directly.
 *
 * \note    g_initialized_magic sentinel (2026-03-25):
 *          write_panic() validates TRINITY_INIT_MAGIC before touching flash
 *          to avoid nested faults if Trinity never completed init.
 *
 * \note    Canary snapshot fix (2026-03-26):
 *          canary_pre_init() copies g_pre_init_canary into g_canary_snapshot
 *          before overwriting with CANARY_ALIVE. dump_previous() reads
 *          g_canary_snapshot so it sees the previous session's value, not
 *          the freshly-written CANARY_ALIVE from this boot.
 *
 * \note    Sched-lock violation fix (2026-03-27):
 *          k_thread_foreach() holds _sched_spinlock for entire iteration.
 *          Calling write_entry() -> k_mutex_lock() inside that region is
 *          illegal and corrupts kernel state under contention.
 *          Confirmed crash: PC=0x5954494E ("NITY") every ~360s.
 *          Fix: collect-then-write. trinity_thread_cb_collect() does only
 *          snprintf under sched lock. write_entry() called after lock released.
 *
 * \note    Stat buffer heap fix (2026-03-28):
 *          s_stat_entries[12] as a static BSS array placed at 0x200079C1.
 *          960-byte span crossed .noinit boundary at 0x20007A80, trampling
 *          g_init_stage, g_pre_init_canary, g_canary_snapshot, g_noinit_guard,
 *          and logging_stack on every stats cycle.
 *          Confirmed via arm-none-eabi-nm: s_stat_entries at 0x200079C1,
 *          g_init_stage at 0x20007A80 -- 191 bytes gap, 960-byte array.
 *          Fix: heap-allocated in trinity_log_init() via k_malloc().
 *          Heap base (0x2000B8B0) is safely above all .noinit and stack
 *          regions.
 *
 * \note    RESETREAS normalize fix (2026-03-27):
 *          RESETREAS is a latched OR-history register. trinity_log_boot_reason()
 *          centralizes decode so all nRF52840 boards get identical logging.
 *          main() must read and clear RESETREAS before calling anything else.
 *
 * \note    Deferred dump split (2026-03-30):
 *          trinity_log_dump_previous() -- bench only, call before WDT init.
 *          RTT is available immediately at boot so the dump can run early.
 *          trinity_log_dump_previous_deferred() -- field/USB only, call
 *          AFTER trinity_wdt_init() and trinity_wdt_kick() so the WDT is
 *          fed before the flash partition scan begins. UART is not available
 *          until after kernel init completes so the dump must be deferred.
 *          trinity_wdt_kick() is called inside find_write_offset() during
 *          the scan to prevent WDT expiry on large partitions.
 *
 * \note    WDT field fix (2026-03-30):
 *          Confirmed via binary search: wdt_install_timeout() causes an
 *          immediate chip reset on nRF52840 when the bootloader WDT is
 *          already armed, even when -ENOTSUP/-EBUSY/-EPERM are all handled
 *          in the return-value path. The reset fires before any UART TX
 *          drains so it appears as pure silence with no output at all.
 *          Root cause: the nRF WDT peripheral latches on first arm and any
 *          subsequent wdt_install_timeout() call triggers a hardware reset
 *          regardless of the Zephyr driver return value.
 *          wdt_setup() has the same problem -- returns -EPERM and resets.
 *          CONFIG_WDT_DISABLE_AT_BOOT is silently ignored on nRF52840
 *          because HAS_WDT_DISABLE_AT_BOOT is never selected by the nRF
 *          WDT driver Kconfig.
 *          Fix: trinity_wdt_init() never calls wdt_install_timeout() or
 *          wdt_setup() on nRF52840. In all modes (bench, field, USB) it
 *          grabs wdt0, assumes channel 0 (bootloader always uses ch0),
 *          feeds immediately, and returns. The main loop kick keeps it
 *          alive. This is identical behaviour to the bench fix -- the
 *          field path just never got the same treatment because it was
 *          silently resetting rather than halting.
 *
 * \note    RESETREAS bitmask fix (2026-03-31):
 *          Trinity originally had incorrect RESETREAS bit definitions.
 *          Corrected against Nordic nRF52840 MDK bitfields header:
 *            ~/zephyrproject/modules/hal/nordic/nrfx/mdk/nrf52840_bitfields.h
 *          Authoritative defines (verbatim from MDK):
 *            POWER_RESETREAS_RESETPIN_Pos (0UL) -- pin reset
 *            POWER_RESETREAS_DOG_Pos      (1UL) -- watchdog reset
 *            POWER_RESETREAS_SREQ_Pos     (2UL) -- soft reset
 *            POWER_RESETREAS_LOCKUP_Pos   (3UL) -- CPU lockup
 *            POWER_RESETREAS_OFF_Pos     (16UL) -- wake from System OFF via GPIO
 *            POWER_RESETREAS_LPCOMP_Pos  (17UL) -- wake from System OFF via LPCOMP
 *            POWER_RESETREAS_DIF_Pos     (18UL) -- wake from System OFF via debug
 *            POWER_RESETREAS_NFC_Pos     (19UL) -- wake from System OFF via NFC
 *            POWER_RESETREAS_VBUS_Pos    (20UL) -- wake from System OFF via VBUS
 *          BROWNOUT is NOT a reset cause on nRF52840 -- no such bit exists.
 *          Previous Trinity definition of TRINITY_RESET_BROWNOUT=(1u<<0) was
 *          wrong -- bit 0 is RESETPIN, not brownout.
 *          0x00000001 = RESET_PIN (pin reset button pressed).
 *          0x00000004 = WATCHDOG (WDT timeout).
 *          0x00000002 = DOG (watchdog -- same as above, raw bit).
 ******************************************************************************/

