MichaelLynnCSU/embedded-iot-hub/nrf52840/temp-sensor/src/legacy/trinity_log_zephyr_nrf.c
#include "trinity_log.h"
#include <zephyr/kernel.h>
#include <zephyr/device.h>
#include <zephyr/storage/flash_map.h>
#include <zephyr/drivers/flash.h>
#include <zephyr/drivers/watchdog.h>
#include <zephyr/fatal.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/debug/thread_analyzer.h>
#include <zephyr/sys/mem_stats.h>
#include <zephyr/init.h>
#include <string.h>
#include <stdio.h>
#include <nrf.h>

/******************************** CONSTANTS ***********************************/

#define LOG_PARTITION_ID    FIXED_PARTITION_ID(log_partition)
#define LOG_MAGIC           0xA55A
#define LOG_ENTRY_SIZE      128
#define LOG_PAGE_SIZE       4096
#define LOG_MSG_MAX         (LOG_ENTRY_SIZE - 8)
#define CRASH_BUF_SIZE      112u
#define STAT_BUF_SIZE       80u
#define MAX_STAT_THREADS    12

#define WDT_TIMEOUT_MS      10000u
#define TRINITY_INIT_MAGIC  0xBEEFCAFEu

/* ARM Cortex-M4 SCB fault register addresses */
#define SCB_CFSR   (*((volatile uint32_t *)0xE000ED28))
#define SCB_HFSR   (*((volatile uint32_t *)0xE000ED2C))
#define SCB_MMFAR  (*((volatile uint32_t *)0xE000ED34))
#define SCB_BFAR   (*((volatile uint32_t *)0xE000ED38))
#define CFSR_MMARVALID  (1u << 7)
#define CFSR_BFARVALID  (1u << 15)

/* nRF52840 RESETREAS bit definitions -- private, not exposed in header */
#define TRINITY_RESET_PIN       (1u << 0)   /* RESETPIN -- pin reset        */
#define TRINITY_RESET_DOG       (1u << 1)   /* DOG -- watchdog reset        */
#define TRINITY_RESET_SREQ      (1u << 2)   /* SREQ -- soft reset           */
#define TRINITY_RESET_LOCKUP    (1u << 3)   /* LOCKUP -- CPU lockup         */
#define TRINITY_RESET_OFF       (1u << 16)  /* OFF -- wake from System OFF  */
#define TRINITY_RESET_LPCOMP    (1u << 17)  /* LPCOMP -- wake from LPCOMP   */
#define TRINITY_RESET_DIF       (1u << 18)  /* DIF -- debug interface wake  */
#define TRINITY_RESET_NFC       (1u << 19)  /* NFC -- NFC field wake        */
#define TRINITY_RESET_VBUS      (1u << 20)  /* VBUS -- VBUS rising wake     */

/************************** STRUCTURE DATA TYPES ******************************/

typedef struct
{
   uint16_t magic;
   uint16_t len;
   uint32_t cycles;   /* k_cycle_get_32() -- immune to interrupt state */
   char     msg[LOG_MSG_MAX];
} LOG_ENTRY_T;

#define ENTRY_TOTAL sizeof(LOG_ENTRY_T)

typedef struct
{
   char msg[STAT_BUF_SIZE];
} STAT_ENTRY_T;

/************************** NOINIT VARIABLES **********************************/

/* g_noinit_guard: sentinel to detect BSS bleed into .noinit.
 * Set to 0xDEADBEEF on first valid boot. If read as 0 on a non-cold boot,
 * BSS zeroing has overrun the section boundary. */
static volatile uint32_t g_noinit_guard
    __attribute__((section(".noinit")));

/* g_init_stage: declared in header as extern, defined here. */
volatile uint32_t g_init_stage
    __attribute__((section(".noinit")));

/* g_pre_init_canary: written CANARY_ALIVE at PRE_KERNEL_1 and upgraded
 * to CANARY_BOOTED inside trinity_log_init(). Reflects CURRENT boot. */
static volatile uint32_t g_pre_init_canary
    __attribute__((section(".noinit")));

/* g_canary_snapshot: copy of g_pre_init_canary saved by canary_pre_init()
 * BEFORE overwriting with CANARY_ALIVE. Holds PREVIOUS session's value. */
static volatile uint32_t g_canary_snapshot
    __attribute__((section(".noinit")));

static int canary_pre_init(void)
{
    g_canary_snapshot = g_pre_init_canary;
    g_pre_init_canary = TRINITY_CANARY_ALIVE;
    return 0;
}
SYS_INIT(canary_pre_init, PRE_KERNEL_1, 0);

/************************** FLASH MUTEX ***************************************/

static struct k_mutex g_flash_mutex;
static bool           g_mutex_ready = false;

/************************** STATIC (PRIVATE) DATA *****************************/

static const struct flash_area *g_log_fa           = NULL;
static uint32_t                 g_write_offset      = 0;
static bool                     g_initialized       = false;
static uint32_t                 g_initialized_magic = 0u;
static bool                     g_part_open         = false;

static const struct device     *g_wdt               = NULL;
static int                      g_wdt_channel       = -1;

/*
 * Thread stats collection buffer -- heap allocated in trinity_log_init().
 *
 * MUST NOT be a static BSS array. The linker may place a 960-byte BSS
 * array at an address that crosses the .noinit boundary (confirmed at
 * 0x200079C1 on smart-lock, crossing .noinit at 0x20007A80), trampling
 * g_init_stage, g_pre_init_canary, g_canary_snapshot, g_noinit_guard,
 * and the logging thread stack. Every stats cycle overwrote these with
 * thread name strings, causing PRE_INIT_CRASH misclassification and
 * PC=0x5954494E HardFaults. Heap base (0x2000B8B0) is safely above all
 * .noinit and stack regions.
 */
static STAT_ENTRY_T *s_stat_entries = NULL;
static int           s_stat_count   = 0;

/************************** STATIC (PRIVATE) FUNCTIONS ************************/

static const char *reason_to_str(unsigned int reason)
{
   switch (reason)
   {
      case K_ERR_CPU_EXCEPTION:  { return "CPU_EXCEPTION";  }
      case K_ERR_SPURIOUS_IRQ:   { return "SPURIOUS_IRQ";   }
      case K_ERR_STACK_CHK_FAIL: { return "STACK_OVERFLOW"; }
      case K_ERR_KERNEL_OOPS:    { return "KERNEL_OOPS";    }
      case K_ERR_KERNEL_PANIC:   { return "KERNEL_PANIC";   }
      default:                   { return "UNKNOWN";        }
   }
}

static const char *stage_to_str(uint32_t stage)
{
   switch (stage)
   {
      case TRINITY_STAGE_RESET:     { return "RESET (cookie not yet written)";           }
      case TRINITY_STAGE_GPIO:      { return "GPIO      -- about to init GPIO/PWM/LED";  }
      case TRINITY_STAGE_BATTERY:   { return "BATTERY   -- about to call battery_init()"; }
      case TRINITY_STAGE_NVS_INIT:  { return "NVS_INIT  -- about to settings_subsys_init()"; }
      case TRINITY_STAGE_NVS_LOAD:  { return "NVS_LOAD  -- about to load settings";     }
      case TRINITY_STAGE_LOG_INIT:  { return "LOG_INIT  -- about to trinity_log_init()"; }
      case TRINITY_STAGE_WDT_INIT:  { return "WDT_INIT  -- about to trinity_wdt_init()"; }
      case TRINITY_STAGE_BT_ENABLE: { return "BT_ENABLE -- about to bt_enable()";       }
      case TRINITY_STAGE_BT_ADV:    { return "BT_ADV    -- about to bt_le_adv_start()"; }
      case TRINITY_STAGE_MAIN_LOOP: { return "MAIN_LOOP -- entered main while(1)";      }
      default:                      { return "UNKNOWN stage value";                     }
   }
}

