MichaelLynnCSU/embedded-iot-hub/nrf52840/temp-sensor/src/legacy/trinity_log_zephyr_nrf.c
static int open_partition(void)
{
   int rc = 0;
   if (g_part_open) { return 0; }
   rc = flash_area_open(LOG_PARTITION_ID, &g_log_fa);
   if (0 == rc) { g_part_open = true; }
   return rc;
}

static void close_partition(void)
{
   if (g_part_open)
   {
      flash_area_close(g_log_fa);
      g_part_open = false;
      g_log_fa    = NULL;
   }
}

static uint32_t find_write_offset(void)
{
   uint32_t    total_entries = 0;
   uint32_t    offset        = 0;
   uint32_t    i             = 0;
   LOG_ENTRY_T entry;

   if (!g_part_open) { return 0; }

   total_entries = g_log_fa->fa_size / ENTRY_TOTAL;
   for (i = 0; i < total_entries; i++)
   {
      trinity_wdt_kick();   /* feed WDT during scan -- partition may be large */
      offset = i * ENTRY_TOTAL;
      (void)flash_area_read(g_log_fa, offset, &entry, sizeof(entry));
      if (LOG_MAGIC != entry.magic) { return offset; }
   }
   return 0;
}

/**
 * \brief  Raw flash write core -- no locks, no OS calls.
 *         Called by write_entry() (holds mutex) and write_panic() (no mutex).
 *         Uses k_cycle_get_32() -- immune to SysTick state at crash time.
 */
static void write_internal(const char *p_msg, uint16_t len)
{
   uint32_t    page_start = 0;
   LOG_ENTRY_T entry;

   if (!g_part_open || 0u == len) { return; }

   (void)memset(&entry, 0xFF, sizeof(entry));
   entry.magic  = LOG_MAGIC;
   entry.cycles = k_cycle_get_32();
   entry.len    = MIN(len, (uint16_t)(sizeof(entry.msg) - 1u));
   (void)memcpy(entry.msg, p_msg, entry.len);
   entry.msg[entry.len] = '\0';

   page_start = (g_write_offset / LOG_PAGE_SIZE) * LOG_PAGE_SIZE;
   if (g_write_offset == page_start)
   {
      (void)flash_area_flatten(g_log_fa, page_start, LOG_PAGE_SIZE);
   }
   (void)flash_area_write(g_log_fa, g_write_offset, &entry, sizeof(entry));

   g_write_offset += ENTRY_TOTAL;
   if ((g_write_offset + ENTRY_TOTAL) > g_log_fa->fa_size)
   {
      g_write_offset = 0u;
   }
}

/** Thread-safe flash write -- acquires g_flash_mutex. Normal thread context. */
static void write_entry(const char *p_msg, uint16_t len)
{
   if (!g_initialized || !g_part_open || 0u == len) { return; }
   k_mutex_lock(&g_flash_mutex, K_FOREVER);
   write_internal(p_msg, len);
   k_mutex_unlock(&g_flash_mutex);
}

/** Lock-free flash write -- fault handler only. Validates init magic first. */
static void write_panic(const char *p_msg, uint16_t len)
{
   if (TRINITY_INIT_MAGIC != g_initialized_magic) { return; }
   if (!g_part_open || 0u == len)                 { return; }
   write_internal(p_msg, len);
}

/************************** PUBLIC FUNCTIONS -- FLASH MUTEX *******************/

void trinity_flash_lock(void)
{
   if (g_mutex_ready) { k_mutex_lock(&g_flash_mutex, K_FOREVER); }
}

void trinity_flash_unlock(void)
{
   if (g_mutex_ready) { k_mutex_unlock(&g_flash_mutex); }
}

/************************** PUBLIC FUNCTIONS -- FLASH LOG *********************/

static void trinity_log_dump_core(void)
{
   uint32_t    total_entries = 0;
   uint32_t    i             = 0;
   bool        found_any     = false;
   LOG_ENTRY_T entry;

   printk("[TRINITY] BUILD: %s | MODE: %s\n",
          CONFIG_TRINITY_MODE_STR,
          IS_ENABLED(CONFIG_TRINITY_MODE_BENCH) ? "BENCH" :
          IS_ENABLED(CONFIG_TRINITY_MODE_USB)   ? "USB"   : "FIELD");

   if (g_noinit_guard != 0xDEADBEEF)
   {
      printk("[TRINITY] NOINIT_GUARD: 0x%08X (first boot or BSS bleed)\n",
             g_noinit_guard);
   }
   g_noinit_guard = 0xDEADBEEF;

   uint32_t canary = g_canary_snapshot;
   uint32_t stage  = g_init_stage;
   g_canary_snapshot = 0U;
   g_init_stage      = TRINITY_STAGE_RESET;

   if (TRINITY_CANARY_ALIVE == canary)
   {
      printk("[TRINITY] EVENT: BOOT | REASON: PRE_INIT_CRASH\n");
      printk("[TRINITY] NOTE: Previous boot crashed before Trinity init.\n");
      printk("[TRINITY] NOTE: ISR stack overflow or early SYS_INIT fault.\n");
      printk("[TRINITY] NOTE: No flash log available for that crash.\n");
      printk("[TRINITY] STAGE: 0x%04X -- %s\n", stage, stage_to_str(stage));
   }
   else if (TRINITY_CANARY_BOOTED == canary)
   {
      printk("[TRINITY] EVENT: BOOT | REASON: POST_INIT_CRASH\n");
      printk("[TRINITY] NOTE: Previous boot crashed after Trinity init.\n");
      printk("[TRINITY] NOTE: Flash log should contain fault details.\n");
      printk("[TRINITY] STAGE: 0x%04X -- %s\n", stage, stage_to_str(stage));
   }
   else
   {
      printk("[TRINITY] NOTE: Cold boot or first power-on detected.\n");
   }

   if (0 != open_partition())
   {
      printk("[TRINITY] Cannot open log partition\n");
      return;
   }

   total_entries = g_log_fa->fa_size / ENTRY_TOTAL;
   printk("=== Previous Session Logs ===\n");

   for (i = 0; i < total_entries; i++)
   {
      (void)flash_area_read(g_log_fa, i * ENTRY_TOTAL, &entry, sizeof(entry));
      if ((LOG_MAGIC == entry.magic) &&
          (0 < entry.len) &&
          (entry.len < sizeof(entry.msg)))
      {
         entry.msg[entry.len] = '\0';
         printk("[%u cyc] %s", entry.cycles, entry.msg);
         found_any = true;
      }
   }

   if (!found_any) { printk("  (no logs found)\n"); }
   printk("=== End of Previous Logs ===\n");
   close_partition();
}

/**
 * \brief  Dump previous session logs -- bench mode only.
 *
 * \details RTT is available immediately at boot. Call before trinity_wdt_init().
 *          Do NOT call in field/USB mode -- UART is not ready this early
 *          and the flash scan may exceed the bootloader WDT window.
 *          Use trinity_log_dump_previous_deferred() for field/USB.
 */
void trinity_log_dump_previous(void)
{
#if defined(CONFIG_TRINITY_MODE_BENCH)
   trinity_log_dump_core();
#endif
}

/**
 * \brief  Dump previous session logs -- field/USB mode only.
 *
 * \details Call AFTER trinity_wdt_init() and trinity_wdt_kick() so the WDT
 *          is fed before the flash partition scan. UART requires kernel init
 *          to complete before it is usable. trinity_wdt_kick() is called
 *          inside find_write_offset() to prevent WDT expiry during scan.
 */
void trinity_log_dump_previous_deferred(void)
{
#if !defined(CONFIG_TRINITY_MODE_BENCH)
   trinity_log_dump_core();
#endif
}

