MichaelLynnCSU/embedded-iot-hub/nrf52840/temp-sensor/src/legacy/trinity_log_zephyr_nrf.c
void trinity_log_boot_reason(uint32_t resetreas)
{
   const char *label   = "NONE";
   char        buf[80] = {0};

   if      (resetreas & TRINITY_RESET_DOG)     { label = "WATCHDOG";   }
   else if (resetreas & TRINITY_RESET_LOCKUP)  { label = "LOCKUP";     }
   else if (resetreas & TRINITY_RESET_SREQ)    { label = "SOFT_RESET"; }
   else if (resetreas & TRINITY_RESET_PIN)     { label = "RESET_PIN";  }
   else if (resetreas & TRINITY_RESET_OFF)     { label = "WAKE_OFF";   }
   else if (resetreas & TRINITY_RESET_VBUS)    { label = "WAKE_VBUS";  }
   else if (resetreas & TRINITY_RESET_DIF)     { label = "WAKE_DIF";   }
   else if (resetreas & TRINITY_RESET_NFC)     { label = "WAKE_NFC";   }
   else if (resetreas & TRINITY_RESET_LPCOMP)  { label = "WAKE_LPCOMP";}

   (void)snprintf(buf, sizeof(buf),
                  "EVENT: BOOT | RESETREAS: 0x%08X | REASON: %s\n",
                  resetreas, label);
   trinity_log_event(buf);
}

int trinity_log_erase(void)
{
   int rc = 0;
   if (!g_part_open)
   {
      rc = open_partition();
      if (0 != rc) { return -EIO; }
   }
   rc             = flash_area_flatten(g_log_fa, 0, g_log_fa->fa_size);
   g_write_offset = 0;
   return rc;
}

void trinity_log_event(const char *p_msg)
{
   if (!g_initialized) { return; }
   write_entry(p_msg, (uint16_t)strlen(p_msg));
   printk("[TRINITY] %s\n", p_msg);
}

int trinity_log_init(void)
{
   int rc = 0;

   k_mutex_init(&g_flash_mutex);
   g_mutex_ready = true;

   rc = open_partition();
   if (0 != rc) { return -EIO; }

   g_write_offset      = find_write_offset();
   g_initialized       = true;
   g_initialized_magic = TRINITY_INIT_MAGIC;
   g_pre_init_canary   = TRINITY_CANARY_BOOTED;

   /* Heap-allocate stat buffer -- must not be BSS (crosses .noinit boundary) */
   s_stat_entries = k_malloc(sizeof(STAT_ENTRY_T) * MAX_STAT_THREADS);
   if (NULL == s_stat_entries)
   {
      printk("[TRINITY] FATAL: stat buffer alloc failed -- thread stats disabled\n");
      return -ENOMEM;
   }

   return 0;
}

/************************** PUBLIC FUNCTIONS -- WATCHDOG **********************/

/**
 * \brief  Initialise Trinity watchdog -- all modes identical on nRF52840.
 *
 * \details The UF2 bootloader arms the WDT before handing off. The peripheral
 *          cannot be stopped or reconfigured once armed:
 *            wdt_install_timeout() -- causes immediate chip reset regardless
 *              of return value (-ENOTSUP/-EBUSY/-EPERM all confirmed).
 *              Confirmed via binary search: adding this call silenced all
 *              UART output before the first printk in field mode.
 *            wdt_setup()           -- same problem, returns -EPERM, resets.
 *            CONFIG_WDT_DISABLE_AT_BOOT -- silently ignored (nRF WDT driver
 *              never selects HAS_WDT_DISABLE_AT_BOOT in Kconfig).
 *
 *          Fix: grab wdt0, assume channel 0, feed immediately, return.
 *          Never call wdt_install_timeout() or wdt_setup(). Applies to
 *          bench, field, and USB modes identically.
 */
void trinity_wdt_init(void)
{
   g_wdt         = DEVICE_DT_GET(DT_NODELABEL(wdt0));
   g_wdt_channel = 0;

   if (!device_is_ready(g_wdt))
   {
      printk("[TRINITY] WDT device not ready\n");
      return;
   }

   wdt_feed(g_wdt, 0);

#if defined(CONFIG_TRINITY_MODE_BENCH)
   printk("[TRINITY] WDT bench-kick (bootloader WDT ch0)\n");
#else
   printk("[TRINITY] WDT field-kick (bootloader WDT ch0)\n");
#endif
}

void trinity_wdt_kick(void)
{
   if ((NULL != g_wdt) && (0 <= g_wdt_channel))
   {
      (void)wdt_feed(g_wdt, g_wdt_channel);
   }
}

/************************** PUBLIC FUNCTIONS -- HEAP STATS ********************/

void trinity_log_heap_stats(void)
{
#if defined(CONFIG_SYS_HEAP_RUNTIME_STATS)
   extern struct k_heap _system_heap;
   struct sys_memory_stats stats = {0};
   char                    msg[STAT_BUF_SIZE];
   int                     rc    = 0;

   rc = sys_heap_runtime_stats_get(&_system_heap.heap, &stats);
   if (0 != rc)
   {
      printk("[TRINITY] Heap stats unavailable\n");
      return;
   }

   (void)snprintf(msg, sizeof(msg),
                  "Heap: free=%zu allocated=%zu max_allocated=%zu\n",
                  stats.free_bytes,
                  stats.allocated_bytes,
                  stats.max_allocated_bytes);
   trinity_log_event(msg);
#else
   trinity_log_event("Heap stats: CONFIG_SYS_HEAP_RUNTIME_STATS not set\n");
#endif
}

/************************** PUBLIC FUNCTIONS -- TASK STATS ********************/

/**
 * \brief  Thread analyzer callback -- runs under sched lock (k_thread_foreach).
 *
 * \warning MUST NOT call write_entry() or k_mutex_lock() here.
 *          Doing so is illegal under sched lock and corrupts kernel state.
 *          Only snprintf into the heap-allocated buffer is permitted.
 */
static void trinity_thread_cb_collect(struct thread_analyzer_info *p_info)
{
   if (NULL == s_stat_entries)            { return; }
   if (s_stat_count >= MAX_STAT_THREADS)  { return; }

   (void)snprintf(s_stat_entries[s_stat_count].msg, STAT_BUF_SIZE,
                  "[TRINITY] Thread: %-16s cpu=%3u%%  stack=%u/%u\n",
                  p_info->name,
                  p_info->utilization,
                  p_info->stack_used,
                  p_info->stack_size);
   s_stat_count++;
}

/**
 * \brief  Log per-thread CPU% and stack HWM -- collect-then-write pattern.
 *
 * \details Phase 1: thread_analyzer_run() collects under sched lock.
 *          Only snprintf into heap buffer -- no mutex, no blocking.
 *          Phase 2: sched lock released. write_entry() called safely.
 *          WDT kicked before Phase 1 and after Phase 2.
 */
void trinity_log_task_stats(void)
{
   int i;

   if (NULL == s_stat_entries) { return; }

   trinity_wdt_kick();
   s_stat_count = 0;
   thread_analyzer_run(trinity_thread_cb_collect, 0);

   trinity_wdt_kick();
   write_entry("[TRINITY] Thread stats:\n",
               (uint16_t)strlen("[TRINITY] Thread stats:\n"));
   printk("[TRINITY] Thread stats:\n");

   for (i = 0; i < s_stat_count; i++)
   {
      write_entry(s_stat_entries[i].msg,
                  (uint16_t)strlen(s_stat_entries[i].msg));
      printk("%s", s_stat_entries[i].msg);
   }
   trinity_wdt_kick();
}

/************************** ZEPHYR FAULT HOOKS ********************************/

void k_sys_fatal_error_handler(unsigned int reason,
                                const struct arch_esf *p_esf)
{
   uint32_t cfsr   = SCB_CFSR;
   uint32_t hfsr   = SCB_HFSR;
   uint32_t mmfar  = (cfsr & CFSR_MMARVALID) ? SCB_MMFAR : 0u;
   uint32_t bfar   = (cfsr & CFSR_BFARVALID) ? SCB_BFAR  : 0u;
   uint32_t cycles = k_cycle_get_32();

   char line1[CRASH_BUF_SIZE] = {0};
   char line2[CRASH_BUF_SIZE] = {0};

   if (NULL != p_esf)
   {
      (void)snprintf(line1, sizeof(line1),
                     "EVENT: CRASH | TYPE: %s(%u)"
                     " | PC: 0x%08X | LR: 0x%08X | SP: 0x%08X"
                     " | CYC: %u | STG: 0x%04X\n",
                     reason_to_str(reason), reason,
                     (unsigned int)p_esf->basic.pc,
                     (unsigned int)p_esf->basic.lr,
                     (unsigned int)p_esf,
                     cycles,
                     (unsigned int)g_init_stage);
   }
   else
   {
      (void)snprintf(line1, sizeof(line1),
                     "EVENT: CRASH | TYPE: %s(%u) | PC: unknown"
                     " | CYC: %u | STG: 0x%04X\n",
                     reason_to_str(reason), reason,
                     cycles,
                     (unsigned int)g_init_stage);
   }

   (void)snprintf(line2, sizeof(line2),
                  "EVENT: FAULT | CFSR: 0x%08X | HFSR: 0x%08X"
                  " | MMFAR: 0x%08X | BFAR: 0x%08X\n",
                  cfsr, hfsr, mmfar, bfar);

   write_panic(line1, (uint16_t)strlen(line1));
   write_panic(line2, (uint16_t)strlen(line2));

#if defined(CONFIG_TRINITY_MODE_BENCH)
   printk("\n[TRINITY] === FAULT HALT ===\n");
   printk("[TRINITY] %s", line1);
   printk("[TRINITY] %s", line2);
   printk("[TRINITY] STG  : 0x%04X -- %s\n",
          (unsigned int)g_init_stage, stage_to_str(g_init_stage));
   printk("[TRINITY] === HALTED -- attach JLink or read RTT ===\n");
   __disable_irq();
   while (1) {}

#elif defined(CONFIG_TRINITY_MODE_USB)
   k_sleep(K_MSEC(500));
   __disable_irq();
   NVIC_SystemReset();

#else
   __disable_irq();
   NVIC_SystemReset();
#endif
}
